const mainContainer = document.getElementById('container');
console.log('давай подумаем что мы можем реально сделать и что будет полезно.');
/*
Итак начинаем размышлени.

Что я хочу сделать?
Я хочу много денег и ИТ фирму, по сути даже не так важно будут ли это игры или что-либо другое. Я просто хочу быть ИТшником в СвоЕЙ фирме и работать на себя
причем полностью, в идеале без партнеров и прочего.

Что я умею?
Я фронтенд разработчик, хотя мне еще много чему необходимо учиться, но это идеальное направление которое приносит мне доход и возможно осенит что-то гениальное,
стану легендарным фронтовиком )

В идеале я хочу свою студию по созданию игр, создание миров, но блин, там нуджны такие ресурсы и мощности + я в этом не бум бумБ это как отдельный далнейший проект.

Нужны свои проекты, причем судя по всему на фронте и познать бэк на ноде или гоу какой нибудь.

Начать нужно дописав мой сраный калькулятор причем на всем чем планировал.
Может даже стоит отказаться от ЖСа и ТСа, написать сразу на Реакте и Вью.
Ангуляр пока не трогать смысла нет, когда нибудь позднее попробовать.



план:
1. Найти для ПК клавиатуру как на маке ибо нихера не удобно и в кнопки не попадаю, переучиваться.

опционально:
1. блять, завтра допишу, разнесли к хуям всю цепочку идей.

*/